[
  {
    "path": "posts/2023-12-31-random-forests/",
    "title": "Random Forests",
    "description": "This post serves as a discussion board for the fourth tab\nin the ML4PP course: Tree-based methods: Random Forests",
    "author": [
      {
        "name": "Michelle González Amador",
        "url": {}
      }
    ],
    "date": "2023-12-31",
    "categories": [
      "Prediction",
      "Tree-based methods",
      "Random Forests",
      "Classification",
      "R",
      "Python"
    ],
    "contents": "\nLast post of 2023!\nIn the Tree-models:RandomForests tab of the ML4PP site, Francisco presented the concept of decision trees and how to use the idea of common regions to split data spaces and make more accurate predictions. The results of a simple and a hyperparameter fine-tuned random forest model (a bagged tree-based model) exercise on the Malawi data showed that our original predictions using a logistic classification approach were just as good as more complex machine learning algorithms. Choosing a Random Forest algorithm to increase our prediction ability was not random. In their paper, Is Random Forest a Superior Methodology for Predicting Poverty? An Empirical Assessment, Pave-Stohnensen and Stender find that this tree-based model is often more accurate at predicting poverty than more traditional econometric models. Whilst we found no big improvement in our exercise, we did see a very minor increase in assessment metric(s). I encourage you to read the suggested readings on the ML4PP course landing page for the tree-based models session. Stephan (who introduced us to Logistic regressions) and Francisco (our host for this lesson) co-authored a very interesting paper on Child Marriage in South Asia. You’ll find the link there ;).\nAs always, please feel free to leave a comment here if you have any questions about decision trees, random forests, and how to assess their performance using R or Python. You can also leave a comment to suggest a date to meet up in Gather.Town with other people so you can chat in real time!\nHappy coding, and happy holidas!\n\n\n\n",
    "preview": "posts/2023-12-31-random-forests/RandomForestRobot.png",
    "last_modified": "2023-12-31T13:57:05+01:00",
    "input_file": {},
    "preview_width": 849,
    "preview_height": 453
  },
  {
    "path": "posts/2023-12-11-logistic-classification/",
    "title": "Logistic Classification",
    "description": "This post serves as a discussion board for the third tab\nin the ML4PP course: Supervised Classification: Logistic Regression.",
    "author": [
      {
        "name": "Michelle González Amador",
        "url": {}
      }
    ],
    "date": "2023-12-11",
    "categories": [
      "Prediction",
      "Policy",
      "Logistic Regression",
      "Classification",
      "R",
      "Python"
    ],
    "contents": "\nOverview\nIn the Classification:Logistic tab of the ML4PP site, Stephan introduced us to a simple binary classification algorithm: the logistic regression. In the previous session, we hinted at the possibility of improving our prediction model. Based on the results of a binary prediction - an individual in Malawi is considered poor if they ball on or below some income threshold - using a logistic regression, we have indeed marginally improved our prediction abilities. Although a simple algorithm, do not underestimate the predictive power of a logistic regression! Complex social problems can sometimes be aided by simple tools. Besides our targeting project (we’re in it for the long haul! … or until we have reached a point where we can no longer improve our predictions), another interesting social good problem that has been tackled by a logistic regression is that of Predicting Micronutrient Deficiency by Elizabeth Bondi-Kelly and friends. Their (logistic) model, which uses satellite imagery, is accurate and outperforms more traditional survey methods. Being able to predict regions that are at risk of malnutrition is key for Health Policymakers to make informed decisions about when and where to allocate vitamins, supplements, or other resources to combat or even prevent it.\nPlease feel free to leave a comment here if you have any questions about binary classification models, in particular a logistic regression model, and how to assess its performance using R or Python. As always, you can also leave a comment to suggest a date to meet up in Gather.Town with other people so you can chat in real time!\nHappy coding, everyone!\n\n\n\n",
    "preview": "posts/2023-12-11-logistic-classification/LogitpythonR.png",
    "last_modified": "2023-12-11T15:58:19+01:00",
    "input_file": {},
    "preview_width": 831,
    "preview_height": 634
  },
  {
    "path": "posts/2023-11-03-introduction/",
    "title": "Introduction to R and Python",
    "description": "This post serves as a discussion board for the first tab\nin the ML4PP course: Introduction to R and Python and, of course,\na general welcome to the course.",
    "author": [
      {
        "name": "Michelle González Amador",
        "url": {}
      }
    ],
    "date": "2023-11-23",
    "categories": [
      "R",
      "Rstudio",
      "Python",
      "Welcome"
    ],
    "contents": "\nOverview\nWe know starting a new programming language can be challenging. Hopefully, you were able to follow the brief R and Python introductory tutorials. If you found difficulties, feel free to leave a message here.\nScript elegance\nThe two introductory scripts, for R and Python, are meant to give you a quick glimpse of the language. They’re by no means elegant. Perhaps a few standard points that were not discussed in the tutorial but that you can take away if you decide to write a script:\nWhen you assign a name to an object, make sure that it is informative. When you start a new project, you might even write down a naming convention. For instance:\nAll variables that measure some form of spending will begin with spend_*\nIf the measurement is related to the individual, it should end by the subscript _i*\n\nTry to contain all instructions related to packages, libraries, and function imports at the beginning of your script, in one chunk. I have broken this rule in the python script (oops!). Do as I say, not as I do. If you realise that you need to load a new library as you go alog (this is perfectly normal!) go back to the section of your script where all that is kept and load it there. It makes for a cleaner look and for easier reproduction of your code.\nFor R, make sure to keep a header containing the R and Rstudio versions you’re using. This is important for transparency and reproducibility of your your code.\nFor Python, make sure you create a virtual environment before starting a script. This is important for reproducibility of your code, as it contains all the installations needed to execute your script.\nIn Python, if you’re collaborating with other people, you might want to include a ‘requirements.txt’ file in your project folder to let others know what installations they might need before attempting to run your script. You can create such a file with a simple command.\nThe list above is not exhaustive, and I am far from an expert on this particular topic. Nonetheless, I hope it is helpful, and that you’ll learn more and better ways to keep your script up to standard!\nA final thought\nFor R, the Rstudio IDE is excellent and free (open source!). However, Python doesn’t have a default user interface. PyCharm is a popular IDE, but it is not free. Personally, I enjoy using Visual Studio Code (and I recommend it), because it is free (hooray!) and it has lots of plugins that are quite helpful. Jupyter Notebook (stands for Julia-Python-R) is also free, user-friendly, and quite popular. For those of you not averse to working with Google products, you can also use the Collaboratory to write scripts. Ultimately, this is a personal preference. Choose wisely and happy coding!\n\n\n\n",
    "preview": "posts/2023-11-03-introduction/pythonR.png",
    "last_modified": "2023-11-23T15:03:28+01:00",
    "input_file": {},
    "preview_width": 898,
    "preview_height": 548
  },
  {
    "path": "posts/2023-11-23-prediction-policy-problems/",
    "title": "Prediction Policy Problems",
    "description": "This post serves as a discussion board for the second tab\nin the ML4PP course: Prediction Policy Problems.",
    "author": [
      {
        "name": "Michelle González Amador",
        "url": {}
      }
    ],
    "date": "2023-11-23",
    "categories": [
      "Prediction",
      "Policy",
      "Linear Regression",
      "Lasso",
      "R",
      "Python"
    ],
    "contents": "\nOverview\nIn the Prediction Policy Problems tab of the ML4PP site there was a brief introduction to what a Prediction Policy Problem is. Furthermore, an use-case on Social Protection Policy was introduced, and we embarked on a machine learning mission: what algorithm can help us predict the prevalence of poverty in Malawi best?\nPlease feel free to leave a comment here if you have any questions about what constitutes a prediction policy problem, how to identify a social need for prediction, or if you have any questions about the practical applications in R or Python. As always, you can also leave a comment to suggest a date to meet up in Gather.Town with other people so you can chat in real time!\nHappy coding, everyone!\n\n\n\n",
    "preview": "posts/2023-11-23-prediction-policy-problems/predpod.png",
    "last_modified": "2023-11-23T15:05:38+01:00",
    "input_file": {},
    "preview_width": 344,
    "preview_height": 284
  }
]
